In [1]:
import pandas as pd
import numpy as np

## Train df process

In [2]:
# Total records
train_df = pd.read_csv('./v2/enrollment_train.csv')
len(train_df)

7087

In [3]:
train_df.head()

,enrollment_id,username,course_id
0,1,9Uee7oEuuMmgPx2IzPfFkWgkHZyPbWr0,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1,20,BoK7CAUaCFqnLgmWLxeOHg8YkXUSeCtc,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
2,23,BoK7CAUaCFqnLgmWLxeOHg8YkXUSeCtc,AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd
3,28,BoK7CAUaCFqnLgmWLxeOHg8YkXUSeCtc,TAYxxh39I2LZnftBpL0LfF2NxzrCKpkx
4,49,2oTvbzieHn2y5oozeOgSnruqE6N0BtR5,7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx

In [4]:
username = train_df.username.unique()
username[:10], len(username)

(array(['9Uee7oEuuMmgPx2IzPfFkWgkHZyPbWr0',
        'BoK7CAUaCFqnLgmWLxeOHg8YkXUSeCtc',
        '2oTvbzieHn2y5oozeOgSnruqE6N0BtR5',
        'l9KseRU4xYtwOzoILYmGcicF0iiXQqxl',
        'KXi2lu4GlKmrO1lJTLg3t4l701rvNXNZ',
        'FX39OUMp2fc5cOhN2hgQkfpLfm3Fwtwz',
        'eakdJaYNzY2KmT602U8CscAjNHHpGkgl',
        'tp9GLoYyljDV6mILQxrtrv1Iw4qcPl5Z',
        'zVX5LPwTGC1SEitxSfv31cubNXKJSEc2',
        'ah2KXEU3IJN3pCxNzFybzDR3Qrtpz7ty'], dtype=object), 1444)

In [5]:
new_username = dict({username[i]: 'user{}'.format(i+1) for i in range(len(username))})
len(new_username)

1444

In [6]:
train_df['username'] = train_df['username'].apply(lambda u : new_username[u])
train_df.head()

   enrollment_id username                         course_id
0              1    user1  DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1             20    user2  DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
2             23    user2  AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd
3             28    user2  TAYxxh39I2LZnftBpL0LfF2NxzrCKpkx
4             49    user3  7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx

In [7]:
course_id = train_df.course_id.unique()
course_id[:10], len(course_id)

(array(['DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila',
        'AXUJZGmZ0xaYSWazu8RQ1G5c76ECT1Kd',
        'TAYxxh39I2LZnftBpL0LfF2NxzrCKpkx',
        '7GRhBDsirIGkRZBtSMEzNTyDr2JQm4xx',
        '5X6FeZozNMgE2VRi3MJYjkkFK8SETtu2',
        'fbPkOYLVPtPgIt0MxizjfFJov3JbHyAi',
        '5Gyp41oLVo7Gg7vF4vpmggWP5MU70QO6',
        'Er0RFawC4sHagDmmQZcBGBrzamLQcblZ',
        'mTmmr5zd8l4wXhwiULwjSmSbi9ktcFmV',
        '81UZtt1JJwBFYMj5u38WNKCSVA4IJSDv'], dtype=object), 37)

In [8]:
new_course_id = dict({ course_id[i]:'course{}'.format(i+1) for i in range(len(course_id))})
len(new_course_id)

37

In [9]:
train_df['course_id'] = train_df['course_id'].apply(lambda i : new_course_id[i])
train_df.head()

   enrollment_id username course_id
0              1    user1   course1
1             20    user2   course1
2             23    user2   course2
3             28    user2   course3
4             49    user3   course4

## Save train df in matrix type to input CF

In [10]:
type(list(new_username.values()))

list

In [11]:
train_data = {}
train_data['user'] = list(new_username.values())
for course_id in new_course_id.values():
    train_data[course_id] = np.zeros(len(list(new_username.values())))

In [12]:
for index, row in train_df.iterrows():
    c_idx = train_data['user'].index(row['username'])
    train_data[row['course_id']][c_idx] = 1

In [13]:
train_data_df = pd.DataFrame(train_data, columns= ['user'] + list(new_course_id.values()))
train_data_df.to_csv('./enroll_train.csv', index = False, header=True)

## Test df process

In [14]:
# Total records
test_df = pd.read_csv('./v2/enrollment_test.csv')
len(test_df)

1304

In [15]:
test_df.head()

,enrollment_id,username,course_id
0,171,BkozGGotFoRWvs7kivTQvwwV5JZ8hddc,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
1,334,uQjl8NGtIQkRfoe9edBiMgtYYmdkzVXR,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
2,425,HlYiU2TA92it9HWOPDlsBmlpdZ7J7QTJ,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
3,677,DBl87nF6WTgoCD6kgTHVE2oB45pDEn6y,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila
4,835,3ZzhbGHk0AMavVBVS0pUAaZvWnLoQODp,DPnLzkJJqOOPRJfBxIHbQEERiYHu5ila

In [16]:
len(test_df.course_id.unique())

37

In [17]:
test_df = test_df[test_df['username'].isin(username)] # filter all user existed in train's username
len(test_df)

1304

In [18]:
test_df['username'] = test_df['username'].apply(lambda u : new_username[u])
test_df['course_id'] = test_df['course_id'].apply(lambda i : new_course_id[i])
test_df['idx'] = test_df.apply(lambda row: row.username.replace('user', ''), axis = 1)

test_df['idx'] = test_df['idx'].astype(float)
test_df = test_df.sort_values(by=['idx'])
test_df.head()

     enrollment_id username course_id  idx
167          16053    user1  course21  1.0
227          23945    user2  course13  2.0
710          96430    user3  course32  3.0
748         103332    user3  course26  3.0
609          79441    user5  course23  5.0

In [19]:
test_data_df = pd.DataFrame(test_df, columns= ['username', 'course_id'])
test_data_df.to_csv('./enroll_test.csv', index = False, header=True)